app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
        def index
            byebug
            @favorites = Favorite.all

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        def show
            favorite = Favorite.find(params[:id])

INSERT INTO "favorites" ("image", "name", "address", "city", "latitude", "longitude", "notes", "price", "rating", "yelp_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
        def create
            favorite= Favorite.create(favorite_params)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "favorites" SET "notes" = $1, "updated_at" = $2 WHERE "favorites"."id" = $3  [["notes", "TASTY FUSION!!!"], ["updated_at", "2020-10-12 21:49:54.390987"], ["id", 1]]
---
        def update
            favorite = Favorite.find(params[:id])
            favorite.update(favorite_params)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 4]]
---
        def destroy
            favorite = Favorite.find(params[:id])
            favorite.delete