app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "email", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        user = User.create(user_params)